
#Область СлужебныеПроцедурыИФункции

// Запускает длительную операцию объединения нескольких документов Расход
//
// Параметры:
//  Ссылки - Массив - Массив из ДокументСсылка.Расход -
//  ОповещениеОЗавершении - ОписаниеОповещения - Оповещение, которое будет вызвано по завершении длительной операции
//                          См. ДлительныеОперацииКлиент.ОжидатьЗавершение()
//  Форма - ФормаКлиентскогоПриложения - Форма, из которой вызывается операция
Процедура НачатьОбъединениеДокументовРасход(Ссылки, ОповещениеОЗавершении, Форма) Экспорт
	Если Ссылки.Количество() < 2 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выделите как минимум две строки в списке'"));
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДоходыРасходыСлужебныйВызовСервера.НачатьОбъединениеДокументовРасход(Ссылки,
		Форма.УникальныйИдентификатор);
	//
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти
