
#Область СлужебныеПроцедурыИФункции

Функция НачатьОбъединениеДокументовРасход(Знач Ссылки, Знач ИдентификаторФормы) Экспорт
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.УточнениеОшибки = НСтр("ru='Не удалось выполнить объединение документов по причине:'");
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Документы.Расход.ОбъединитьДокументы", Ссылки);
	Возврат ДлительнаяОперация;
КонецФункции

#КонецОбласти
