
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_Расход" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// BSLLS:TransferringParametersBetweenClientAndServer-off
// Код БСП модифицировать не буду
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// BSLLS:TransferringParametersBetweenClientAndServer-on

&НаКлиенте
Процедура ОбъединитьВыделенные(Команда)
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеОбъединенияДокументов", ЭтотОбъект);
	ДоходыРасходыСлужебныйКлиент.НачатьОбъединениеДокументовРасход(Ссылки, ОповещениеОЗавершении, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДлительнаяОперацияОбъединенияДокументов

&НаКлиенте
Процедура ПослеОбъединенияДокументов(РезультатОперации, ДополнительныеПараметры) Экспорт
	ОбщегоНазначенияПятьДенегКлиент.ПоказатьОшибкуДлительнойОперации(РезультатОперации);
	Если Не ОбщегоНазначенияПятьДенегКлиент.ДлительнаяОперацияУспешна(РезультатОперации) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйДокумент = ПолучитьИзВременногоХранилища(РезультатОперации.АдресРезультата);
	Если ЗначениеЗаполнено(НовыйДокумент) Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(Новый ОписаниеТипов("ДокументСсылка.Расход"));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Документы не были объединены. Подробности выведены в панель сообщений'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
