
#Область ПрограммныйИнтерфейс

// Если длительная операция завершена с ошибкой, показывает предупреждение пользователю
//
// Параметры:
//  РезультатДлительнойОперации - См. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
Процедура ПоказатьОшибкуДлительнойОперации(РезультатДлительнойОперации) Экспорт
	Если РезультатДлительнойОперации <> Неопределено И РезультатДлительнойОперации.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(РезультатДлительнойОперации.ИнформацияОбОшибке);
	КонецЕсли;
КонецПроцедуры

// Возвращает Истина, когда длительная операция завершена полностью и без ошибок
//
// Параметры:
//  РезультатДлительнойОперации - См. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
// 
// Возвращаемое значение:
//  Булево -
Функция ДлительнаяОперацияУспешна(РезультатДлительнойОперации) Экспорт
	Возврат РезультатДлительнойОперации <> Неопределено И РезультатДлительнойОперации.Статус = "Выполнено";
КонецФункции

#КонецОбласти
