
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет команду для данного отчета в таблицу команд
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
Процедура ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт
	Команда = КомандыОтчетов.Добавить();
	Команда.Идентификатор = Метаданные.Отчеты.ОстаткиНаСчетах.Имя;
	Команда.Представление = Метаданные.Отчеты.ОстаткиНаСчетах.Синоним;
	Команда.Менеджер = Метаданные.Отчеты.ОстаткиНаСчетах.ПолноеИмя();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
