
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
    //
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника РолиИсполнителей.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Неучтенное";
	Элемент.КатегорияРасходовПоУмолчанию = Справочники.КатегорииРасходов.ПоУмолчанию;
КонецПроцедуры

// Возвращает используемую по умолчанию категорию расходов
//
// Параметры:
//  СтатьяРасходов - СправочникСсылка.СтатьиРасходов -
//
// Возвращаемое значение:
//  СправочникСсылка.КатегорииРасходов -
Функция КатегорияРасходовПоУмолчанию(СтатьяРасходов) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяРасходов, "КатегорияРасходовПоУмолчанию");
КонецФункции

// Инициализирует объект значениями по умолчанию
//
// Параметры:
//  Объект - СправочникОбъект.СтатьиРасходов, ДанныеФормыСтруктура -
Процедура ЗаполнитьНовыйОбъект(Объект) Экспорт
	Объект.КатегорияРасходовПоУмолчанию = Константы.КатегорияРасходовДляНовыхСтатейРасходов.Получить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьСписокПравилВеденияАналитикСтатьямиПоВсемРасходам(Таблица)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиАналитики.Ссылка КАК СтатьяАналитики,
		|	СтатьиАналитики.ВидДвиженияДляВсехРасходов КАК ВидДвижения
		|ИЗ
		|	Справочник.СтатьиАналитики КАК СтатьиАналитики
		|ГДЕ
		|	НЕ СтатьиАналитики.ПометкаУдаления
		|	И СтатьиАналитики.ВидДвиженияДляВсехРасходов <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрТаблица = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТаблица, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
